Revit 2027 API
SpecTypeId.DuctLiningThickness Property
 Duct Lining Thickness, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DuctLiningThickness { get; }
Public Shared ReadOnly Property DuctLiningThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DuctLiningThickness {
	ForgeTypeId^ get ();
}
static member DuctLiningThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace